In [1]:
import pandas as pd

In [23]:
# Lets create a new DataFrame to perform groupby function
dict = {'Company':['GOOGLE','GOOGLE', 'MICROSOFT', 'MICROSOFT', 'FACEBOOK', 'FACEBOOK'],
        'Person': ['IDRIS', 'AIZAZ', 'ZAKIR', 'AWAIS', 'OSAMA', 'MUAVIA'],
        'SALES': [200 ,120 ,150, 180, 112, 110]}

In [24]:
df = pd.DataFrame(dict)

In [25]:
df

     Company  Person  SALES
0     GOOGLE   IDRIS    200
1     GOOGLE   AIZAZ    120
2  MICROSOFT   ZAKIR    150
3  MICROSOFT   AWAIS    180
4   FACEBOOK   OSAMA    112
5   FACEBOOK  MUAVIA    110

In [31]:
# As we can see we have companies with the same name so we can apply groupby method
df.groupby('Company').describe()

          SALES
          count   mean        std    min    25%    50%    75%    max
Company
FACEBOOK    2.0  111.0   1.414214  110.0  110.5  111.0  111.5  112.0
GOOGLE      2.0  160.0  56.568542  120.0  140.0  160.0  180.0  200.0
MICROSOFT   2.0  165.0  21.213203  150.0  157.5  165.0  172.5  180.0

In [32]:
df.groupby('Company').max()

          Person  SALES
Company
FACEBOOK   OSAMA    112
GOOGLE     IDRIS    200
MICROSOFT  ZAKIR    180